smileym4n-collab/ESP32S3I2S/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# ESP32-S3-N16R8: 16 MB flash, 8 MB octal PSRAM.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y

# Keep USB audio and I2S service latency predictable.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# Espressif's TinyUSB-based USB Audio Class device component.
# It currently advertises one compile-time sample rate.
CONFIG_UAC_TUSB_MANUFACTURER="Custom"
CONFIG_UAC_TUSB_PRODUCT="Tom Watson Audio"
CONFIG_UAC_TUSB_SERIAL_NUM="TOMWATSONAUDIO001"
CONFIG_UAC_SPEAKER_CHANNEL_NUM=2
CONFIG_UAC_MIC_CHANNEL_NUM=0
CONFIG_UAC_SAMPLE_RATE=48000
CONFIG_UAC_SPK_INTERVAL_MS=10
CONFIG_UAC_SPK_NEW_PLAY_INTERVAL=100
CONFIG_UAC_SUPPORT_MACOS=y
CONFIG_UAC_TINYUSB_TASK_PRIORITY=7
CONFIG_UAC_SPK_TASK_PRIORITY=7

# The vendored usb_device_uac component owns the TinyUSB descriptors.
CONFIG_USB_DEVICE_UAC_AS_PART=n

# Local firmware audio defaults. Set the three GPIO values with menuconfig
# once the custom board pinout is final.
CONFIG_AUDIO_SAMPLE_RATE_48000=y
CONFIG_AUDIO_BIT_DEPTH_16=y
CONFIG_AUDIO_I2S_BCLK_GPIO=-1
CONFIG_AUDIO_I2S_WS_GPIO=-1
CONFIG_AUDIO_I2S_DATA_GPIO=-1
CONFIG_AUDIO_I2S_DMA_DESC_NUM=8
CONFIG_AUDIO_I2S_DMA_FRAME_NUM=240
CONFIG_AUDIO_STREAM_BUFFER_MS=128
CONFIG_AUDIO_PREFILL_MS=40
CONFIG_AUDIO_IDLE_STOP_MS=1000
